{
  "backend/main.mo": "Defines actor with access control and many public types for trading, strategies, backtests, insights, settings, and portfolios.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend source files.",
  "frontend/index.css": "Empty or placeholder stylesheet file with no content provided.",
  "frontend/index.html": "HTML entry point configuring Market Rotation Radar metadata, manifest link, and root app mount.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining Market Rotation Radar app name, theme, icons, and startup configuration.",
  "frontend/public/sw.js": "Service worker implementing basic install, fetch caching, and cache cleanup with versioned cache name.",
  "frontend/src/App.tsx": "Main React app wiring theme provider, data fetching, alert logic, dashboard layout, and toast rendering.",
  "frontend/src/components/AIAdvisoryBadge.tsx": "Component generating AI advisory text based on indicators and rendering a styled badge with tooltip.",
  "frontend/src/components/AIForecastPanel.tsx": "Displays AI-generated crypto forecasts, accuracy summaries, and sensitivity controls based on selected coin and sparkline data.",
  "frontend/src/components/AIInsightPanel.tsx": "Computes and visualizes market-wide technical insights like sentiment, RSI conditions, and EMA trends.",
  "frontend/src/components/AIOptimizerPanel.tsx": "Shows optimizer metrics, accuracy rates, and AI learning insights derived from trade prediction analysis.",
  "frontend/src/components/AlertHistoryPanel.tsx": "Loads, filters, displays, and exports historical alert events with search and type/date filters.",
  "frontend/src/components/AlertOnboardingDialog.tsx": "Guides users through enabling alert notifications and saves onboarding preferences.",
  "frontend/src/components/AlertSettingsPanel.tsx": "Component providing UI controls for enabling alerts, configuring notification types, and saving user alert preferences.",
  "frontend/src/components/AlertToast.tsx": "Toast component that displays animated trade alert notifications with icons, titles, and dismissal behavior.",
  "frontend/src/components/BacktestingPanel.tsx": "Panel for running predefined trading strategy backtests on sparkline data and displaying performance metrics and charts.",
  "frontend/src/components/CoinChart.tsx": "Crypto chart component supporting line and candlestick views, technical indicators like EMA and RSI, and tooltip rendering.",
  "frontend/src/components/CoinDetailDialog.tsx": "Dialog showing detailed coin information including market data, charts, AI forecasts, and trading zone insights.",
  "frontend/src/components/CorrelationHeatmap.tsx": "Renders a correlation heatmap for crypto assets, showing BTC correlations, divergences, and rotation signals. Uses generated matrices and UI cards to display metrics and visual indicators.",
  "frontend/src/components/CryptoTable.tsx": "Displays a sortable, searchable crypto table with pagination and smart entry/exit zone indicators. Integrates price formatting, confidence badges, and row selection handling.",
  "frontend/src/components/DominanceMetrics.tsx": "Shows BTC, ETH, USDT dominance and Total 3 market cap using styled metric cards. Provides formatted percentage and market cap summaries.",
  "frontend/src/components/FilterControls.tsx": "Empty file with no implemented content.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying credits and a link to caffeine.ai.",
  "frontend/src/components/ForecastAccuracyChart.tsx": "Loads historical forecast data, computes accuracy scores, and renders accuracy badges and a predictions vs actuals line chart. Displays fallback UI when no history exists.",
  "frontend/src/components/ForecastSensitivityControls.tsx": "Provides radio controls for selecting forecast sensitivity modes with descriptive labels and multipliers. Wrapped in a styled card with icons and badges.",
  "frontend/src/components/ForecastVerificationTool.tsx": "Displays forecast accuracy metrics and charts by loading verification data for a selected crypto symbol. Shows overall accuracy, timeframe breakdowns, and prediction-vs-actual charts.",
  "frontend/src/components/Header.tsx": "Renders the app header with theme toggle, tracked coins manager, and login button. Uses next-themes for light/dark mode switching.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity login/logout with loading states and error recovery. Clears React Query cache on logout.",
  "frontend/src/components/PerformanceAnalytics.tsx": "Shows trading performance metrics and trends using mock data with various charts and tabs. Includes refresh and export controls.",
  "frontend/src/components/PerformanceModeToggle.tsx": "Toggles a high-performance mode that reduces UI load and updates stored performance settings. Displays active optimizations when enabled.",
  "frontend/src/components/PineScriptStrategies.tsx": "Empty placeholder component file with no implementation.",
  "frontend/src/components/PortfolioSimulationPanel.tsx": "Manages a simulated trading portfolio with opening/closing positions, capital tracking, and metrics. Integrates RSI/EMA signals to assign signal strength on trade entry.",
  "frontend/src/components/ProfitZonePanel.tsx": "Displays top profit opportunities based on historical ROI zones and probability analysis. Renders detailed zone cards with prices, success rates, and metrics.",
  "frontend/src/components/PwaInstallHelp.tsx": "Displays platform-specific instructions for installing the app as a PWA, detecting standalone mode and user platform.",
  "frontend/src/components/ReadyToDump.tsx": "Analyzes crypto data to score dump potential, generates commentary, and displays top bearish candidates with interaction support.",
  "frontend/src/components/ReadyToPump.tsx": "Computes pump potential scores for cryptocurrencies, provides AI commentary, and shows top bullish candidates selectable by the user.",
  "frontend/src/components/RiskManagementPanel.tsx": "Shows portfolio risk metrics and allows configuring risk parameters using stored settings and live crypto data.",
  "frontend/src/components/rotation/BucketSummaryPanel.tsx": "Shows performance metrics for each rotation bucket including 24h change, BTC-relative strength, and breadth.",
  "frontend/src/components/rotation/FlowLeadersView.tsx": "Filters and ranks coins by performance, volume, BTC-relative change, and correlation, showing leaders and laggards.",
  "frontend/src/components/rotation/HowToUseRotationRadarDialog.tsx": "Provides a dialog explaining rotation buckets, phases, confidence scores, and how to use flow and leader tools.",
  "frontend/src/components/rotation/RotationAlertHistoryPanel.tsx": "Placeholder panel showing past rotation alerts, currently empty with no stored history.",
  "frontend/src/components/rotation/RotationAlertsPanel.tsx": "Settings panel allowing users to configure rotation alert notifications and threshold values.",
  "frontend/src/components/rotation/RotationPhasePanel.tsx": "Displays the current market rotation phase with confidence, explanation, and key signals, falling back to an alert if no phase is available.",
  "frontend/src/components/rotation/RotationRadarDashboard.tsx": "Computes bucket classifications, metrics, and rotation phase to render the full market rotation dashboard with loading and error states.",
  "frontend/src/components/ScanControlPanel.tsx": "Empty placeholder component file with no implementation.",
  "frontend/src/components/SensitivityControlPanel.tsx": "Controls signal sensitivity via thresholds, presets, and live stats, saving settings and emitting threshold changes.",
  "frontend/src/components/SettingsControlCenter.tsx": "Provides a settings overview card with access to help content and other configuration panels.",
  "frontend/src/components/SignalPerformance.tsx": "Computes and displays performance metrics for EMA and RSI-based signals, with selectable categories and detailed coin lists in a dialog.",
  "frontend/src/components/StrategyCard.tsx": "Empty file with no implemented component.",
  "frontend/src/components/ThemeToggle.tsx": "Provides a mounted-safe theme toggle button that switches between light and dark modes using next-themes.",
  "frontend/src/components/TopSignals.tsx": "Empty file with no implemented component.",
  "frontend/src/components/Total3Chart.tsx": "Renders a card visualizing BTC, ETH, and Total3 market cap distribution with percentage bars and metrics.",
  "frontend/src/components/TrackedCoinsManager.tsx": "Manages user-selected tracked coins with localStorage persistence, search, and preference initialization.",
  "frontend/src/components/TradeEntryZonePanel.tsx": "Displays active and projected long/short entry and exit zones with filtering, dialogs, and confidence indicators.",
  "frontend/src/components/TradeJournalAnalyticsPanel.tsx": "Loads trade journal analytics and displays key metrics, charts, and performance summaries.",
  "frontend/src/components/WhaleTrackerPanel.tsx": "Displays whale movement activity by analyzing sparklines and listing top accumulation or distribution events.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useAlertSystem.ts": "Tracks trading zone signals and triggers browser notifications, sounds, and history entries while preventing duplicate alerts.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading stored identities and exposing login, clear, and status helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching crypto data and managing user positions, strategies, profiles, and settings through the backend actor.",
  "frontend/src/hooks/useRotationRadarSettings.ts": "Fetches, updates, and resets user rotation radar settings using the backend actor with local defaults when unauthenticated.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme CSS variables, base styles, touch utilities, and UI component styling overrides.",
  "frontend/src/lib/aiOptimizer.ts": "Implements tracking, updating, and evaluating AI trading signal outcomes with stored metrics and adaptive threshold logic.",
  "frontend/src/lib/alertSystem.ts": "Manages alert preferences, history, and cooldowns for trade confidence signals using localStorage.",
  "frontend/src/lib/backtesting.ts": "Provides a historical backtesting engine for trading strategies, storing results and calculating performance metrics.",
  "frontend/src/lib/binanceApi.ts": "Empty placeholder for Binance API integration.",
  "frontend/src/lib/coinCapApi.ts": "Empty placeholder for CoinCap API integration.",
  "frontend/src/lib/coinGeckoApi.ts": "Empty placeholder for CoinGecko API integration.",
  "frontend/src/lib/coinRankingApi.ts": "Defines CoinRanking data interfaces and optimized fetching with caching for top cryptocurrencies and market metrics.",
  "frontend/src/lib/correlationAnalysis.ts": "Computes correlations, divergences, and rotation signals between crypto assets based on price sparklines.",
  "frontend/src/lib/debug.ts": "Provides optional debug logging utilities controlled by a single flag.",
  "frontend/src/lib/forecastEngine.ts": "Defines forecasting models and computes technical indicators like MACD, EMA, momentum, and generates timeframe-based crypto forecasts.",
  "frontend/src/lib/performanceMode.ts": "Manages performance mode settings with localStorage, controlling animations, caching, polling, and refresh intervals.",
  "frontend/src/lib/portfolioSimulation.ts": "Handles virtual trading by storing positions, capital, and PnL, and provides functions to open, close, and track simulated trades.",
  "frontend/src/lib/profitZones.ts": "Computes support/resistance, ROI probabilities, profit ranges, and risk metrics for identifying profit zones in crypto prices.",
  "frontend/src/lib/riskManagement.ts": "Provides risk parameter storage and calculates position sizing, stop loss, take profit, ATR, and support/resistance levels.",
  "frontend/src/lib/rotationBuckets.ts": "Classifies cryptocurrencies into rotation buckets (BTC, ETH, Majors, Mid-caps, Micro-caps) based on market cap rankings.",
  "frontend/src/lib/rotationMetrics.ts": "Calculates performance, momentum, breadth, and volume trend metrics for each rotation bucket relative to BTC.",
  "frontend/src/lib/rotationPhase.ts": "Infers the market rotation phase using BTC, ETH, majors, and mid-cap performance with hysteresis to avoid rapid switching.",
  "frontend/src/lib/sensitivityControl.ts": "Manages sensitivity settings, thresholds, and filtering of trading opportunities with localStorage persistence.",
  "frontend/src/lib/technicalIndicators.ts": "Placeholder file with no implemented content.",
  "frontend/src/lib/tradeEntryZone.ts": "Defines entry, exit, short, and cover zone signal structures and includes indicator calculations like EMA and MACD with history tracking.",
  "frontend/src/lib/tradeJournalAnalytics.ts": "Handles creation, updating, and analytics of trade journal entries synced with alerts and closed positions.",
  "frontend/src/lib/utils.ts": "Provides utility functions for class merging and formatting currency, percentages, and large numbers.",
  "frontend/src/lib/whaleTracker.ts": "Detects and analyzes whale accumulation or distribution activity based on price and volume patterns, storing recent movements.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page that fetches crypto data, applies filtering and metrics, and renders many analytical panels and dialogs.",
  "frontend/src/pages/StrategyLibrary.tsx": "Placeholder or empty page for a strategy library feature.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugin setup.",
  "project_state.json": "Project state file describing the Market Rotation Radar app, its features, requirements, and metadata."
}